### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # kubernetes_secret.onp_minecraft_debug_secrets will be created
+   resource "kubernetes_secret" "onp_minecraft_debug_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--common--config-secrets"
+           namespace        = "seichi-debug-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_minecraft_prod_secrets will be created
+   resource "kubernetes_secret" "onp_minecraft_prod_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--common--config-secrets"
+           namespace        = "seichi-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_minecraft_secrets["seichi-debug-minecraft"] will be destroyed
  # (because kubernetes_secret.onp_minecraft_secrets is not in configuration)
-   resource "kubernetes_secret" "onp_minecraft_secrets" {
-       data      = (sensitive value)
-       id        = "seichi-debug-minecraft/mcserver--common--config-secrets" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "mcserver--common--config-secrets" -> null
-           namespace        = "seichi-debug-minecraft" -> null
-           resource_version = "5124522" -> null
-           uid              = "35741ea1-3c9d-4566-9b75-839acca37249" -> null
        }
    }

  # kubernetes_secret.onp_minecraft_secrets["seichi-minecraft"] will be destroyed
  # (because kubernetes_secret.onp_minecraft_secrets is not in configuration)
-   resource "kubernetes_secret" "onp_minecraft_secrets" {
-       data      = (sensitive value)
-       id        = "seichi-minecraft/mcserver--common--config-secrets" -> null
-       immutable = false -> null
-       type      = "Opaque" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "mcserver--common--config-secrets" -> null
-           namespace        = "seichi-minecraft" -> null
-           resource_version = "5124521" -> null
-           uid              = "627557fc-9d0c-44ca-9334-86b49cca5f77" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>